---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueRatio
source: html/3734c4ff-6966-cc3e-d8a2-407219909ca6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueRatio Property

"Start Attachment Ratio"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentStartValueRatio { get; }
```